{
    "questions": [
      { "id": 1, "q": "Anda rutin mendapatkan teman baru." },
      { "id": 2, "q": "Ide-ide kompleks dan baru lebih membuat Anda bersemangat daripada yang sederhana." },
      { "id": 3, "q": "Anda biasanya merasa lebih terpengaruh oleh apa yang beresonansi secara emosional dengan Anda daripada oleh argumen faktual." },
      { "id": 4, "q": "Ruang hidup dan kerja Anda bersih dan terorganisir." },
      { "id": 5, "q": "Anda biasanya tetap tenang sekalipun sedang dalam banyak tekanan." },
      { "id": 6, "q": "Anda merasa konsep berjejaring atau memperkenalkan diri kepada orang asing sangat menakutkan." },
      { "id": 7, "q": "Anda memprioritaskan dan merencanakan tugas dengan efektif, seringkali menyelesaikannya jauh sebelum tenggat waktu." },
      { "id": 8, "q": "Kisah dan penghayatan emosi seseorang mempunyai dampak lebih signifikan bagi Anda daripada angka atau data." },
      { "id": 9, "q": "Anda suka menggunakan alat pengorganisasian seperti jadwal dan daftar tugas." },
      { "id": 10, "q": "Kesalahan kecil pun dapat menyebabkan Anda ragu dengan kemampuan dan pengetahuan Anda." },
      { "id": 11, "q": "Anda merasa nyaman untuk mendekati seseorang yang menurut Anda menarik dan memulai percakapan." },
      { "id": 12, "q": "Anda tidak terlalu tertarik dalam diskusi tentang berbagai interpretasi karya kreatif." },
      { "id": 13, "q": "Anda mengutamakan fakta daripada perasaan orang ketika menentukan langkah tindakan." },
      { "id": 14, "q": "Anda sering membiarkan hari berlalu tanpa jadwal sama sekali." },
      { "id": 15, "q": "Anda jarang mengkhawatirkan kesan orang terhadap diri Anda." },
      { "id": 16, "q": "Anda menikmati berpartisipasi dalam kegiatan berbasis tim." },
      { "id": 17, "q": "Anda menikmati bereksperimen dengan pendekatan baru dan belum teruji." },
      { "id": 18, "q": "Anda lebih mengutamakan untuk bersikap peka daripada sepenuhnya jujur." },
      { "id": 19, "q": "Anda secara aktif mencari pengalaman dan area pengetahuan baru untuk dijelajahi." },
      { "id": 20, "q": "Anda mudah merasa khawatir bahwa segala hal akan berubah menjadi lebih buruk." },
      { "id": 21, "q": "Anda lebih menikmati hobi atau aktivitas individual daripada yang perlu dilakukan berkelompok." },
      { "id": 22, "q": "Anda tidak dapat membayangkan diri Anda menulis cerita fiksi sebagai mata pencaharian." },
      { "id": 23, "q": "Anda lebih memilih efisiensi dalam pengambilan keputusan, meskipun itu berarti mengabaikan beberapa aspek emosional." },
      { "id": 24, "q": "Saat terjadi perselisihan, Anda lebih mengutamakan membuktikan pendapat Anda daripada menjaga perasaan orang lain." },
      { "id": 25, "q": "Saat ada acara sosial, Anda biasanya menunggu orang lain untuk memperkenalkan diri terlebih dahulu." },
      { "id": 26, "q": "Suasana hati Anda bisa berubah dengan sangat cepat." },
      { "id": 27, "q": "Anda tidak mudah terpengaruh oleh argumen yang berlandaskan emosi." },
      { "id": 28, "q": "Anda sering menunda pekerjaan hingga detik-detik terakhir." },
      { "id": 29, "q": "Anda senang berdebat tentang dilema etika." },
      { "id": 30, "q": "Anda biasanya lebih suka berada di sekitar orang lain daripada sendirian." },
      { "id": 31, "q": "Anda merasa bosan atau kehilangan minat saat diskusi menjadi terlalu teoretis." },
      { "id": 32, "q": "Saat ada pertentangan antara kenyataan dan perasaan, Anda biasanya lebih memilih untuk mengikuti kata hati." },
      { "id": 33, "q": "Bagi Anda, menjaga konsistensi jadwal kerja atau belajar adalah sebuah tantangan." },
      { "id": 34, "q": "Anda jarang mempertanyakan keputusan yang telah Anda buat." },
      { "id": 35, "q": "Teman-teman Anda menggambarkan diri Anda sebagai orang yang energik dan ramah." },
      { "id": 36, "q": "Anda tertarik pada berbagai bentuk ekspresi kreatif, seperti menulis." },
      { "id": 37, "q": "Anda biasanya membuat pilihan berdasarkan fakta objektif daripada kesan emosional." },
      { "id": 38, "q": "Anda suka menyusun daftar tugas sehari-hari." },
      { "id": 39, "q": "Anda jarang merasa cemas." },
      { "id": 40, "q": "Anda menghindari melakukan panggilan telepon." },
      { "id": 41, "q": "Anda senang menggali ide dan sudut pandang yang kurang dikenal." },
      { "id": 42, "q": "Anda mudah berinteraksi dengan orang yang baru dikenal." },
      { "id": 43, "q": "Jika rencana Anda terganggu, prioritas utama Anda adalah kembali ke rencana tersebut secepat mungkin." },
      { "id": 44, "q": "Anda masih merasa terganggu dengan kesalahan yang Anda lakukan di masa lalu." },
      { "id": 45, "q": "Anda tidak terlalu tertarik untuk membahas teori tentang masa depan dunia." },
      { "id": 46, "q": "Emosi lebih dominan mengendalikan diri Anda." },
      { "id": 47, "q": "Saat mengambil keputusan, Anda lebih mempertimbangkan perasaan orang yang terkena dampak keputusan itu daripada pertimbangan yang paling logis atau efisien." },
      { "id": 48, "q": "Gaya kerja pribadi Anda lebih mendekati letupan energi spontan daripada upaya yang teratur dan konsisten." },
      { "id": 49, "q": "Ketika seseorang mengagumi Anda, Anda penasaran kapan mereka akhirnya merasa kecewa pada Anda." },
      { "id": 50, "q": "Anda akan menyukai pekerjaan yang mengharuskan untuk lebih banyak bekerja sendiri." },
      { "id": 51, "q": "Anda percaya bahwa merenungkan pertanyaan filosofis abstrak hanya membuang-buang waktu." },
      { "id": 52, "q": "Anda lebih tertarik pada suasana ramai dan sibuk daripada tempat tenang dan akrab." },
      { "id": 53, "q": "Jika Anda merasa itulah keputusan yang terbaik, Anda sering bertindak berdasarkan pertimbangan tersebut tanpa memerlukan bukti lebih lanjut." },
      { "id": 54, "q": "Anda sering merasa kewalahan." },
      { "id": 55, "q": "Anda menyelesaikan berbagai hal menurut metode tanpa melewatkan langkah apa pun." },
      { "id": 56, "q": "Anda lebih menyukai tugas yang memerlukan solusi kreatif daripada mengikuti prosedur yang sudah ditentukan." },
      { "id": 57, "q": "Saat membuat pilihan, Anda lebih cenderung mengandalkan intuisi emosional daripada penalaran logis." },
      { "id": 58, "q": "Anda kesulitan memenuhi tenggat." },
      { "id": 59, "q": "Anda yakin bahwa segalanya akan berjalan dengan baik." }
    ]
  }
  