{
    "questions": [
        {
            "id": 1,
            "q": "Kamu rutin mendapatkan teman baru.",
            "dimension": "EI",
            "side": "E"
        },
        {
            "id": 2,
            "q": "Ide-ide kompleks dan baru lebih membuat Kamu bersemangat daripada yang sederhana.",
            "dimension": "SN",
            "side": "N"
        },
        {
            "id": 3,
            "q": "Kamu biasanya merasa lebih terpengaruh oleh apa yang beresonansi secara emosional dengan Kamu daripada oleh argumen faktual.",
            "dimension": "TF",
            "side": "F"
        },
        {
            "id": 4,
            "q": "Ruang hidup dan kerja Kamu bersih dan terorganisir.",
            "dimension": "JP",
            "side": "J"
        },
        {
            "id": 5,
            "q": "Kamu biasanya tetap tenang sekalipun sedang dalam banyak tekanan.",
            "dimension": "TF",
            "side": "T"
        },
        {
            "id": 6,
            "q": "Kamu merasa konsep berjejaring atau memperkenalkan diri kepada orang asing sangat menakutkan.",
            "dimension": "EI",
            "side": "I"
        },
        {
            "id": 7,
            "q": "Kamu memprioritaskan dan merencanakan tugas dengan efektif, seringkali menyelesaikannya jauh sebelum tenggat waktu.",
            "dimension": "JP",
            "side": "J"
        },
        {
            "id": 8,
            "q": "Kisah dan penghayatan emosi seseorang mempunyai dampak lebih signifikan bagi Kamu daripada angka atau data.",
            "dimension": "TF",
            "side": "F"
        },
        {
            "id": 9,
            "q": "Kamu suka menggunakan alat pengorganisasian seperti jadwal dan daftar tugas.",
            "dimension": "JP",
            "side": "J"
        },
        {
            "id": 10,
            "q": "Kesalahan kecil pun dapat menyebabkan Kamu ragu dengan kemampuan dan pengetahuan Anda.",
            "dimension": "TF",
            "side": "F"
        },
        {
            "id": 11,
            "q": "Kamu merasa nyaman untuk mendekati seseorang yang menurut Kamu menarik dan memulai percakapan.",
            "dimension": "EI",
            "side": "E"
        },
        {
            "id": 12,
            "q": "Kamu tidak terlalu tertarik dalam diskusi tentang berbagai interpretasi karya kreatif.",
            "dimension": "SN",
            "side": "S"
        },
        {
            "id": 13,
            "q": "Kamu mengutamakan fakta daripada perasaan orang ketika menentukan langkah tindakan.",
            "dimension": "TF",
            "side": "T"
        },
        {
            "id": 14,
            "q": "Kamu sering membiarkan hari berlalu tanpa jadwal sama sekali.",
            "dimension": "JP",
            "side": "P"
        },
        {
            "id": 15,
            "q": "Kamu jarang mengkhawatirkan kesan orang terhadap diri Anda.",
            "dimension": "TF",
            "side": "T"
        },
        {
            "id": 16,
            "q": "Kamu menikmati berpartisipasi dalam kegiatan berbasis tim.",
            "dimension": "EI",
            "side": "E"
        },
        {
            "id": 17,
            "q": "Kamu menikmati bereksperimen dengan pendekatan baru dan belum teruji.",
            "dimension": "SN",
            "side": "N"
        },
        {
            "id": 18,
            "q": "Kamu lebih mengutamakan untuk bersikap peka daripada sepenuhnya jujur.",
            "dimension": "TF",
            "side": "F"
        },
        {
            "id": 19,
            "q": "Kamu secara aktif mencari pengalaman dan area pengetahuan baru untuk dijelajahi.",
            "dimension": "SN",
            "side": "N"
        },
        {
            "id": 20,
            "q": "Kamu mudah merasa khawatir bahwa segala hal akan berubah menjadi lebih buruk.",
            "dimension": "TF",
            "side": "F"
        },
        {
            "id": 21,
            "q": "Kamu lebih menikmati hobi atau aktivitas individual daripada yang perlu dilakukan berkelompok.",
            "dimension": "EI",
            "side": "I"
        },
        {
            "id": 22,
            "q": "Kamu tidak dapat membayangkan diri Kamu menulis cerita fiksi sebagai mata pencaharian.",
            "dimension": "SN",
            "side": "S"
        },
        {
            "id": 23,
            "q": "Kamu lebih memilih efisiensi dalam pengambilan keputusan, meskipun itu berarti mengabaikan beberapa aspek emosional.",
            "dimension": "TF",
            "side": "T"
        },
        {
            "id": 24,
            "q": "Saat terjadi perselisihan, Kamu lebih mengutamakan membuktikan pendapat Kamu daripada menjaga perasaan orang lain.",
            "dimension": "TF",
            "side": "T"
        },
        {
            "id": 25,
            "q": "Saat ada acara sosial, Kamu biasanya menunggu orang lain untuk memperkenalkan diri terlebih dahulu.",
            "dimension": "EI",
            "side": "I"
        },
        {
            "id": 26,
            "q": "Suasana hati Kamu bisa berubah dengan sangat cepat.",
            "dimension": "TF",
            "side": "F"
        },
        {
            "id": 27,
            "q": "Kamu tidak mudah terpengaruh oleh argumen yang berlandaskan emosi.",
            "dimension": "TF",
            "side": "T"
        },
        {
            "id": 28,
            "q": "Kamu sering menunda pekerjaan hingga detik-detik terakhir.",
            "dimension": "JP",
            "side": "P"
        },
        {
            "id": 29,
            "q": "Kamu senang berdebat tentang dilema etika.",
            "dimension": "TF",
            "side": "T"
        },
        {
            "id": 30,
            "q": "Kamu biasanya lebih suka berada di sekitar orang lain daripada sendirian.",
            "dimension": "EI",
            "side": "E"
        },
        {
            "id": 31,
            "q": "Kamu merasa bosan atau kehilangan minat saat diskusi menjadi terlalu teoretis.",
            "dimension": "SN",
            "side": "S"
        },
        {
            "id": 32,
            "q": "Saat ada pertentangan antara kenyataan dan perasaan, Kamu biasanya lebih memilih untuk mengikuti kata hati.",
            "dimension": "TF",
            "side": "F"
        },
        {
            "id": 33,
            "q": "Bagi Anda, menjaga konsistensi jadwal kerja atau belajar adalah sebuah tantangan.",
            "dimension": "JP",
            "side": "P"
        },
        {
            "id": 34,
            "q": "Kamu jarang mempertanyakan keputusan yang telah Kamu buat.",
            "dimension": "TF",
            "side": "T"
        },
        {
            "id": 35,
            "q": "Teman-teman Kamu menggambarkan diri Kamu sebagai orang yang energik dan ramah.",
            "dimension": "EI",
            "side": "E"
        },
        {
            "id": 36,
            "q": "Kamu tertarik pada berbagai bentuk ekspresi kreatif, seperti menulis.",
            "dimension": "SN",
            "side": "N"
        },
        {
            "id": 37,
            "q": "Kamu biasanya membuat pilihan berdasarkan fakta objektif daripada kesan emosional.",
            "dimension": "TF",
            "side": "T"
        },
        {
            "id": 38,
            "q": "Kamu suka menyusun daftar tugas sehari-hari.",
            "dimension": "JP",
            "side": "J"
        },
        {
            "id": 39,
            "q": "Kamu jarang merasa cemas.",
            "dimension": "TF",
            "side": "T"
        },
        {
            "id": 40,
            "q": "Kamu menghindari melakukan panggilan telepon.",
            "dimension": "EI",
            "side": "I"
        },
        {
            "id": 41,
            "q": "Kamu senang menggali ide dan sudut pandang yang kurang dikenal.",
            "dimension": "SN",
            "side": "N"
        },
        {
            "id": 42,
            "q": "Kamu mudah berinteraksi dengan orang yang baru dikenal.",
            "dimension": "EI",
            "side": "E"
        },
        {
            "id": 43,
            "q": "Jika rencana Kamu terganggu, prioritas utama Kamu adalah kembali ke rencana tersebut secepat mungkin.",
            "dimension": "JP",
            "side": "J"
        },
        {
            "id": 44,
            "q": "Kamu masih merasa terganggu dengan kesalahan yang Kamu lakukan di masa lalu.",
            "dimension": "TF",
            "side": "F"
        },
        {
            "id": 45,
            "q": "Kamu tidak terlalu tertarik untuk membahas teori tentang masa depan dunia.",
            "dimension": "SN",
            "side": "S"
        },
        {
            "id": 46,
            "q": "Emosi lebih dominan mengendalikan diri Anda.",
            "dimension": "TF",
            "side": "F"
        },
        {
            "id": 47,
            "q": "Saat mengambil keputusan, Kamu lebih mempertimbangkan perasaan orang yang terkena dampak keputusan itu daripada pertimbangan yang paling logis atau efisien.",
            "dimension": "TF",
            "side": "F"
        },
        {
            "id": 48,
            "q": "Gaya kerja pribadi Kamu lebih mendekati letupan energi spontan daripada upaya yang teratur dan konsisten.",
            "dimension": "JP",
            "side": "P"
        },
        {
            "id": 49,
            "q": "Ketika seseorang mengagumi Anda, Kamu penasaran kapan mereka akhirnya merasa kecewa pada Anda.",
            "dimension": "TF",
            "side": "F"
        },
        {
            "id": 50,
            "q": "Kamu akan menyukai pekerjaan yang mengharuskan untuk lebih banyak bekerja sendiri.",
            "dimension": "EI",
            "side": "I"
        },
        {
            "id": 51,
            "q": "Kamu percaya bahwa merenungkan pertanyaan filosofis abstrak hanya membuang-buang waktu.",
            "dimension": "SN",
            "side": "S"
        },
        {
            "id": 52,
            "q": "Kamu lebih tertarik pada suasana ramai dan sibuk daripada tempat tenang dan akrab.",
            "dimension": "EI",
            "side": "E"
        },
        {
            "id": 53,
            "q": "Jika Kamu merasa itulah keputusan yang terbaik, Kamu sering bertindak berdasarkan pertimbangan tersebut tanpa memerlukan bukti lebih lanjut.",
            "dimension": "TF",
            "side": "T"
        },
        {
            "id": 54,
            "q": "Kamu sering merasa kewalahan.",
            "dimension": "TF",
            "side": "F"
        },
        {
            "id": 55,
            "q": "Kamu menyelesaikan berbagai hal menurut metode tanpa melewatkan langkah apa pun.",
            "dimension": "JP",
            "side": "J"
        },
        {
            "id": 56,
            "q": "Kamu lebih menyukai tugas yang memerlukan solusi kreatif daripada mengikuti prosedur yang sudah ditentukan.",
            "dimension": "SN",
            "side": "N"
        },
        {
            "id": 57,
            "q": "Saat membuat pilihan, Kamu lebih cenderung mengandalkan intuisi emosional daripada penalaran logis.",
            "dimension": "TF",
            "side": "F"
        },
        {
            "id": 58,
            "q": "Kamu kesulitan memenuhi tenggat.",
            "dimension": "JP",
            "side": "P"
        },
        {
            "id": 59,
            "q": "Kamu yakin bahwa segalanya akan berjalan dengan baik.",
            "dimension": "TF",
            "side": "T"
        }
    ]
}